namespace Game
{
    // 1.造成伤害  
    // 2.改变属性 
    // 3.施加buff类   
    // 4.激活类
    // 5.玩家属性类 
    // 6.特殊类  
    // 7.减免类
    //
    //
    // 类型分类
    // 类型1.造成伤害
    // 1.武器伤害
    //
    // 类型2.改变属性
    // 1.造成额外伤害+X
    // 2.下次攻击造成伤害+X
    // 3.触发间隔 %
    // 4.命中率
    //
    // 类型3 施加/移除类
    // buffId
    //
    // 类型4.激活类
    // 1.激活次数
    //
    // 类型5:玩家属性类
    // 1.生命值 值
    // 2.耐力 值
    // 3.生命值 百分比
    // 4.耐力 百分比
    //
    //
    // 类型6.特殊类
    // 1.无视护甲
    // 2.下次攻击计算两次
    //
    // 类型7:减免类
    // 1.减免收到的伤害

    public interface IEffect
    {
        public void Do(int effectId, int creatActorId, int attachEntityId);


    }
}